export interface Company {
  id: number
  name: string
  desc: string
  img: string
  services: string[]
  specialty?: string        // حوزه تخصصی فعالیت
  foundationYear?: string   // سال تاسیس
  contactNumber?: string    // شماره تماس
  registrationNumber?: string // شماره ثبت
  address?: string          // آدرس
  nationalId?: string       // شناسه ملی
  resume?: string    
}

export const companies: Company[] = [
  {
    id: 1,
    name: 'شرکت راهکار هوشمند سپهر',
    desc: 'مجری و مشاور پروژه های هوش مصنوعی در صنعت',
    img: '/brand-1.jpeg',
    services: [],
  },
  {
    id: 2,
    name: 'هماورد',
    desc: 'اولین پلتفرم جامع حوزه ورزش و فناوری',
    img: '/brand-2.jpg',
    services: [],
  },
  {
    id: 3,
    name: 'پایتون تیک',
    desc: 'توسعه زیست بوم خلاق برنامه نویسی با نام تجاری پایتون تیک شرکت نوپایی از آزمایشگاه بهینه سازی دکتر رضا قنبری',
    img: '/brand-4.png',
    services: [
      'ایجاد خلاقیت و نوآوری در کودکان و نوجوانان',
      'آمادگی برای مشاغل آینده',
      'تقویت مهارت حل مسئله و افزایش دانش علمی و عملی',
      'آموزش زبان برنامه‌نویسی پایتون',
    ],
  },
  {
    id: 4,
    name: 'اسپرسو',
    desc: 'همراه راهبردی رشد و برندینگ کسب و کار ها',
    img: '/brand-3.png',
    services: [],
  },
  {
    id: 5,
    name: 'رایاکوچ آریان',
    desc: `پیشتاز در ارائه خدمات جامع کوچینگ فردی و سازمانی در ایران.  
    با بیش از یک دهه تجربه ارزشمند، توسعه و تعالی سازمان‌ها و افراد را هدف خود قرار داده‌ایم.  
    رایا کوچ آریان با دانش تخصصی، رویکردی اصیل و تیمی حرفه‌ای، همراه شما در دستیابی به اهداف استراتژیک است.  
    سفر ما از پژوهش و شناخت اصول کوچینگ آغاز شد و با ارائه دوره‌ها و خدمات رسمی در شرق کشور ادامه یافت.  
    در سال 1397 تیم تخصصی رایا کوچ شکل گرفت و پروژه‌های موفق متعددی در حوزه کوچینگ افراد، کسب‌وکار و سازمان‌ها اجرا شد.  
    ثبت رسمی شرکت در سال 1398، نقطه عطفی در مسیر حرفه‌ای ما بود.`,
    img: '/brand-6.png',
    services: [
      'ایجاد خلاقیت و نوآوری در کودکان و نوجوانان',
      'آمادگی برای مشاغل آینده',
      'تقویت مهارت حل مسئله و افزایش دانش علمی و عملی',
      'آموزش زبان برنامه‌نویسی پایتون',
    ],
  },
]
